import os
import time
import re
import Config

s = '[微笑][撇嘴][色][发呆][得意][流泪][害羞][闭嘴][睡][大哭][尴尬][发怒][调皮][呲牙][惊讶][难过][囧][抓狂][吐][偷笑][愉快][白眼][傲慢][困][惊恐][流汗][憨笑][悠闲][奋斗][' \
    '咒骂][疑问][嘘][晕][衰][骷髅][敲打][再见][擦汗][抠鼻][鼓掌][坏笑][左哼哼][右哼哼][哈欠][鄙视][委屈][快哭了][阴险][亲亲][可怜][菜刀][西瓜][啤酒][咖啡][猪头][玫瑰][凋谢][' \
    '嘴唇][爱心][心碎][蛋糕][炸弹][便便][月亮][太阳][拥抱][强][弱][握手][胜利][抱拳][勾引][拳头][OK][跳跳][发抖][怄火][转圈][嘿哈][捂脸][奸笑][机智][皱眉][耶][红包][發][' \
    '小狗][吃瓜][加油][汗][天啊][Emm][社会社会][旺柴][好的][打脸][哇][福] '

# print(Config.isBoring(""))
#
# # lambda x:

par = re.compile(r'\[[^\[\]]{1,4}\]')
rsu = par.findall(s)
print(rsu)
